Revit 2021.1 API
TopographyEditScope Properties
The TopographyEditScope type exposes the following members.
Properties
Name | Description
IsActive
 Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
 (Inherited from EditScope.)
IsPermitted
 Tests if the TopographyEditScope is permitted to start.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from EditScope.)
See Also
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace